app/controllers/questions_controller.rb

INSERT INTO "questions" ("title", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @question = Question.new(question_params)

    if @question.save