app/controllers/results_controller.rb

  def index
    @results = Result.all
---
SELECT "results".* FROM "results"

  def create
    @result = Result.new(result_params)
    result_params[:question_id]

    if @result.save
---
INSERT INTO "results" ("user_id", "question_id", "user_result", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["question_id", 1], ["user_result", true], ["created_at", "2019-09-10 20:22:22.769080"], ["updated_at", "2019-09-10 20:22:22.769080"]]

    def set_result
      @result = Result.find(params[:id])
---
SELECT "results".* FROM "results" WHERE "results"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]