app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "peter"], ["email", "peterfuoco@gmail.com"], ["password", "password"], ["created_at", "2019-09-10 20:08:22.641745"], ["updated_at", "2019-09-10 20:08:22.641745"]]
---
  def create
    @user = User.new(user_params)

    if @user.save